import React from "react";

const TermsOfServiceContent = () => (
  <div>
    <h2>이용 약관 동의</h2>
    <p>
      본 이용 약관(이하 '약관')은 당사와 이용 고객(이하 '회원')간에 당사의
      서비스의 제공 조건 및 절차, 회원과 당사의 권리, 의무, 책임사항 및 기타
      필요한 사항을 규정함을 목적으로 합니다.
    </p>

    <h3>제1조(목적)</h3>
    <p>
      이 약관은 회원이 당사가 제공하는 인터넷 관련 서비스(이하 '서비스')를
      이용함에 있어 회원과 당사의 권리·의무 및 책임사항을 규정함을 목적으로
      합니다.
    </p>

    <h3>제2조(정의)</h3>
    <p>이 약관에서 사용하는 용어의 정의는 다음과 같습니다.</p>
    <ul>
      <li>
        '회원'이라 함은 당사의 서비스에 접속하여 이 약관에 따라 당사와 이용
        계약을 체결하고 당사가 제공하는 서비스를 이용하는 고객을 말합니다.
      </li>
      <li>
        '이용 계약'이라 함은 서비스 이용과 관련하여 당사와 회원 간에 체결하는
        계약을 말합니다.
      </li>
      <li>
        '이용자 ID'라 함은 회원의 식별과 회원의 서비스 이용을 위하여 회원이 정한
        문자와 숫자의 조합을 말합니다.
      </li>
      <li>
        '비밀번호'라 함은 회원이 부여받은 이용자 ID와 일치된 회원임을 확인하고
        비밀을 보호하기 위하여 회원 자신이 정한 문자 또는 숫자의 조합을
        말합니다.
      </li>
    </ul>

    <h3>제3조(약관의 명시와 개정)</h3>
    <p>
      당사는 이 약관의 내용을 회원이 쉽게 알 수 있도록 서비스 초기 화면에
      게시합니다. 당사는 약관의 규제에 관한 법률, 정보통신망 이용촉진 및
      정보보호 등에 관한 법률, 소비자보호법 등 관련 법을 위배하지 않는 범위에서
      이 약관을 개정할 수 있습니다.
    </p>

    <h3>제4조(서비스의 제공 및 변경)</h3>
    <p>당사는 다음과 같은 업무를 수행합니다.</p>
    <ul>
      <li>인터넷을 통한 정보 제공 서비스 운영</li>
      <li>기타 당사가 정하는 업무</li>
    </ul>
    <p>
      당사는 필요한 경우 서비스의 내용을 변경할 수 있으며, 이에 대해 회원에게
      공지합니다. 당사는 서비스의 내용이 변경된 경우, 변경된 서비스의 내용과
      제공 일자를 명시하여 현재의 서비스 내용을 공지하거나 통지합니다.
    </p>

    <h3>제5조(서비스의 중단)</h3>
    <p>
      당사는 컴퓨터 등 정보통신설비의 보수점검·교체 및 고장, 통신의 두절 등의
      사유가 발생한 경우 서비스의 제공을 일시적으로 중단할 수 있습니다. 이 경우
      당사는 회원에게 통지합니다. 단, 당사가 사전에 통지할 수 없는 사유가 있는
      경우 사후에 통지할 수 있습니다.
    </p>

    <h3>제6조(회원 탈퇴 및 자격 상실 등)</h3>
    <p>
      회원이 다음 각 호의 사유에 해당하는 경우, 당사는 회원자격을 제한 및
      정지시킬 수 있습니다.
    </p>
    <ul>
      <li>가입 신청 시에 허위 내용을 등록한 경우</li>
      <li>
        다른 사람의 서비스 이용을 방해하거나 그 정보를 도용하는 등
        전자거래질서를 위협하는 경우
      </li>
      <li>
        서비스를 이용하여 법령 또는 이 약관이 금지하거나 공서양속에 반하는
        행위를 하는 경우
      </li>
    </ul>

    <h3>제7조(개인정보보호)</h3>
    <p>
      당사는 회원의 개인정보 수집 시 서비스 제공을 위한 목적으로 필요한 최소한의
      정보를 수집합니다. 당사에서 요구하는 개인정보의 범위를 초과하여 수집하지
      않습니다.
    </p>

    <p>기타 상세한 사항은 회사의 개인정보 처리방침을 따릅니다.</p>
  </div>
);

export default TermsOfServiceContent;
